/******************************************************************************
创建者：康泉
创建日期：2018.03.01
功能描述：
    1. 字库
    2. 
    
更新记录：
    1. 2018.05.18 初次创建
    
*******************************************************************************/

#include "ZiKu.h"


const struct str_LANG_PACKAGE g_LangPack_CHN = 
{

};


/////////////////////////////////////////////////////////////////////////
// 汉字库: 黑体56.dot 横向取模高位在前,阴码顺向 数据排列:从左到右从上到下  图标       //
const typFNT_GB56 GB_56[] =        // 数据表   // 16
{

};

// 汉字库: 黑体48.dot 横向取模高位在前,阴码顺向 数据排列:从左到右从上到下  图标       //
const typFNT_GB48 GB_48[] =        // 数据表   // 16
{

};

// 汉字库: 黑体40.dot 横向取模高位在前,阴码顺向 数据排列:从左到右从上到下  图标       //
const typFNT_GB40 GB_40[] =        // 数据表   // 16
{

};

// 汉字库: 黑体32.dot 横向取模高位在前,阴码顺向 数据排列:从左到右从上到下  图标       //
const typFNT_GB32 GB_32[] =        // 数据表   // 16
{

};



const struct typFNT_GB24 GB_24[] =        // 数据表   // 66
{

};

// 汉字表：Font:黑体20, 纵向取模上高位,数据排列:从上到下从左到右
const typFNT_GB20 GB_20[] =        // 数据表183+4  
{

};

// 汉字字模表 (16 X 16 , 宋体 加粗 )                                                         //
const typFNT_GB16 GB_16[] = 
{

};

// 汉字字模表  /* (12 X 12 , 宋体 )*/                                                        //
const typFNT_GB12 GB_12[] = 
{

};

const typPIC_W104_icon W_104[] =
{

};

const unsigned char HC_HDxxx_48x256Dot[] =
{

};

